Revit 2024 API
WaterLoopData.Dispose Method
Releases all resources used by the WaterLoopData
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
WaterLoopData Class
Autodesk.Revit.DB.Mechanical Namespace